﻿/* Notification that a user reacted to a note that the current user was tagged in */
"reacted_tagged_in_1" = "%@ reacted ต่อโน้ตที่คุณถูกแท็ก";

/* Notification that 2 users reacted to a note that the current user was tagged in */
"reacted_tagged_in_2" = "%@ และ %@ reacted ต่อโน๊ตที่คุณถูกแท็ก";

/* Notification that a user reposted a note that the current user was tagged in */
"reposted_tagged_in_1" = "%@ รีโพสต์โน้ตที่คุณถูกแท็ก";

/* Notification that 2 users reposted a note that the current user was tagged in */
"reposted_tagged_in_2" = "%@ และ %@ รีโพสต์โน้ตที่คุณถูกแท็ก";

/* Notification that a user zapped a note that the current user was tagged in */
"zapped_tagged_in_1" = "%@ Zap โน้ตที่คุณถูกแท็ก";

/* Notification that 2 users zapped a note that the current user was tagged in */
"zapped_tagged_in_2" = "%@ และ %@  Zap โน้ตที่คุณถูกแท็ก";

/* Notification that a user reacted to the current user's note */
"reacted_your_note_1" = "%@ react ต่อโน้ตของคุณ";

/* Notification that 2 users reacted to the current user's profile */
"reacted_your_note_2" = "%@ และ %@  react ต่อโน้ตของคุณ";

/* Notification that a user reposted the current user's note */
"reposted_your_note_1" = "%@ รีโพสต์โน้ตของคุณ";

/* Notification that 2 users reposted the current user's note */
"reposted_your_note_2" = "%@ และ %@ รีโพสต์โน้ตของคุณ";

/* Notification that a user zapped the current user's note */
"zapped_your_note_1" = "%@ Zap โน้ตของคุณ";

/* Notification that 2 users zapped the current user's note */
"zapped_your_note_2" = "%@ และ %@ Zap โน้ตของคุณ";

/* Notification that a user reacted to the current user's profile */
"reacted_your_profile_1" = "%@ react โปรไฟล์ของคุณ";

/* Notification that 2 users reacted to the current user's profile */
"reacted_your_profile_2" = "%@ และ %@ react โปรไฟล์ของคุณ";

/* Notification that a user reposted the current user's profile */
"reposted_your_profile_1" = "%@รีโพสต์โปรไฟล์ของคุณ";

/* Notification that 2 users reposted the current user's profile */
"reposted_your_profile_2" = "%@ และ %@ รีโพสต์โปรไฟล์ของคุณ";

/* Notification that a user zapped the current user's profile */
"zapped_your_profile_1" = "%@ Zap คุณ";

/* Notification that 2 users zapped the current user's profile */
"zapped_your_profile_2" = "%@ และ %@ Zap คุณ";

/* Suggested users category for users who may post content about Nostr */
"suggested_users_nostr" = "NOSTR";

/* Suggested users category for users who may post content about permaculture, livestock, and gardening */
"suggested_users_permaculture_livestock_gardening" = "การเกษตรแบบยั่งยืน, ปศุสัตว์ และการทำสวน";

/* Suggested users category for users who may post content about music */
"suggested_users_music" = "เพลง";

/* Suggested users category for users who may post content about books */
"suggested_users_books" = "หนังสือ";

/* Suggested users category for users who may post content about art and photography */
"suggested_users_art_photography" = "ศิลปะ และการถ่ายภาพ";

/* Suggested users category for users who may post content about AI art */
"suggested_users_ai_art" = "ศิลปะ เอไอ";

/* Suggested users category for users who may post content about parenting */
"suggested_users_parenting" = "การเลี้ยงลูก";

/* Suggested users category for users who may post content about food */
"suggested_users_food" = "อาหาร";
/* Navigation link to search hashtag. */
"#%@" = "#%@";

/* Sentence composed of 2 variables to describe how many imports were performed from loading a NostrScript. In source English, the first variable is the number of imports, and the second variable is 'Import' or 'Imports'.
   Sentence composed of 2 variables to describe how many people are following a user. In source English, the first variable is the number of followers, and the second variable is 'Follower' or 'Followers'.
   Sentence composed of 2 variables to describe how many profiles a user is following. In source English, the first variable is the number of profiles being followed, and the second variable is 'Following'.
   Sentence composed of 2 variables to describe how many quoted reposts. In source English, the first variable is the number of reposts, and the second variable is 'Repost' or 'Reposts'.
   Sentence composed of 2 variables to describe how many reactions there are on a post. In source English, the first variable is the number of reactions, and the second variable is 'Reaction' or 'Reactions'.
   Sentence composed of 2 variables to describe how many relay servers a user is connected. In source English, the first variable is the number of relay servers, and the second variable is 'Relay' or 'Relays'.
   Sentence composed of 2 variables to describe how many reposts. In source English, the first variable is the number of reposts, and the second variable is 'Repost' or 'Reposts'.
   Sentence composed of 2 variables to describe how many zap payments there are on a post. In source English, the first variable is the number of zap payments, and the second variable is 'Zap' or 'Zaps'. */
"%@ %@" = "%1$@%2$@";

/* Amount of money required to subscribe to the Nostr relay. In English, this would look something like '4,000 sats / 30 days', meaning it costs 4000 sats to subscribe to the Nostr relay for 30 days. */
"%@ / %@" = "%1$@/%2$@";

/* Amount of money required to publish to the Nostr relay. In English, this would look something like '10 sats / event', meaning it costs 10 sats to publish one event. */
"%@ / event" = "%@ / event";

/* Alert message that informs a user was muted. */
"%@ has been muted" = "%@ ถูกปิดการมองเห็นแล้ว";

/* When a note or profile is not found when searching for it via its note id */
"%@ not found" = "ไม่พบ %@";

/* Reacted by heading in local notification */
"%@ reacted with %@" = "%1$@ react กับ %2$@";

/* Heading for local notification indicating a new reply */
"%@ replied to your note" = "%@ ตอบกลับโน้ตของคุณ";

/* Percentage of additional zap that should be sent to support Damus development. */
"%@%" = "%1$@%2$";

/* Explanation of what is done to keep personally identifiable information private. There is a heading that precedes this explanation which is a variable to this string. */
"%@. Creating an account doesn't require a phone number, email or name. Get started right away with zero friction." = "%@ การสร้างบัญชีไม่จำเป็นต้องใช้เบอร์โทรศัพท์ อีเมล หรือชื่อจริง เริ่มต้นใช้งานได้เลย";

/* Explanation of what is done to keep private data encrypted. There is a heading that precedes this explanation which is a variable to this string. */
"%@. End-to-End encrypted private messaging. Keep Big Tech out of your DMs" = "%@ ข้อความส่วนตัวที่เข้ารหัสแบบ End-to-End ช่วยให้บริษัทเทคโนโลยียักษ์ใหญ่ไม่สามารถเข้าถึงข้อความส่วนตัวของคุณได้";

/* Explanation of what can be done by users to earn money. There is a heading that precedes this explanation which is a variable to this string. */
"%@. Tip your friends and stack sats with Bitcoin⚡️, the native currency of the internet." = "%@ ให้ทิปเพื่อนๆ และสะสม sats ด้วย Bitcoin⚡️ , สกุลเงินดั้งเดิมของอินเทอร์เน็ต";

/* Fraction of how many of the user's relay servers that are operational. */
"%@/%@" = "%1$@/%2$@";

/* Description of why the Nostr address is invalid. */
"'%@' is an invalid Nostr address. It should look like an email address." = "'%@' เป็นแอดเดรส Nostr ที่ไม่ถูกต้อง โดยควรมีรูปแบบคล้ายชื่ออีเมล";

/* Label on push notification indicating that the contents of the message are encrypted */
"(Contents are encrypted)" = "(เนื้อหาถูกเข้ารหัส)";

/* A duration of 1 month to be shown to the user. Most likely in the context of how long they want to mute a piece of content for. */
"1 month" = "1 เดือน";

/* A duration of 1 week to be shown to the user. Most likely in the context of how long they want to mute a piece of content for. */
"1 week" = "1 สัปดาห์";

/* A duration of 24 hours/1 day to be shown to the user. Most likely in the context of how long they want to mute a piece of content for. */
"24 hours" = "24 ชั่วโมง";

/* Label for About Me section of user profile form. */
"About Me" = "เกี่ยวกับฉัน";

/* Placeholder text for About Me description. */
"Absolute Boss" = "เจ๋งไปเลยนาย";

/* Example Bio */
"Absolute legend." = "ตำนานของแทร่";

/* Section header for accessibility settings */
"Accessibility" = "การเข้าถึงได้";

/* Label for Purple account creation date */
"Account creation" = "การสร้างบัญชีผู้ใช้";

/* Accessibility label for the private key input field */
"Account private key" = "ไพรเวทคีย์ของบัญชี";

/* Title for confirmation dialog to either share, report, or mute a profile. */
"Actions" = "การดำเนินการ";

/* Badge indicating user has an active Damus Purple account */
"Active account" = "บัญชีผู้ใช้ที่ยังใช้งานอยู่";

/* Button to add relay server to list. */
"Add" = "เพิ่ม";

/* Button label to re-add all original participants as profiles to reply to in a note */
"Add all" = "เพิ่มทั้งหมด";

/* Placeholder as an example of what the user could set so that the link is opened when the status is tapped. */
"Add an external link" = "เพิ่มลิงก์ภายนอก";

/* Button text to add bookmark to a note. */
"Add Bookmark" = "เพิ่มบุ๊กมาร์ก";

/* Context menu option for adding a note bookmark. */
"Add bookmark" = "เพิ่มบุ๊กมาร์ก";

/* Button to an add an item to the user's mutelist.
   Title text to indicate user to an add an item to their mutelist. */
"Add mute item" = "เพิ่มสิ่งที่ไม่ต้องการเห็น";

/* Button text to add a relay
   Button to add a relay.
   Title text to indicate user to an add a relay. */
"Add relay" = "เพิ่มรีเลย์";

/* Prompt given to the user during onboarding, suggesting them to write their first post */
"Add your first post" = "โพสต์ข้อความแรกของคุณ";

/* Button to show relay server is already added to list. */
"Added" = "ถูกเพิ่มเรียบร้อย";

/* Header text to prompt user to optionally provide additional information when reporting a user or note. */
"Additional information" = "ข้อมูลเพิ่มเติม";

/* Text label indicating the profile picture underneath it is the admin of the Nostr relay. */
"ADMIN" = "ผู้ดูแลระบบ";

/* Human-readable short description of the 'friends filter' when it is set to 'all'
   Label for filter for all notifications. */
"All" = "ทั้งหมด";

/* A label indicating that the notes being displayed below it are all recent notes */
"All recent notes" = "โน้ตล่าสุดทั้งหมด";

/* Ask the user if they already have an account on Nostr */
"Already on Nostr?" = "เคยใช้ Nostr มาก่อนแล้วใช่ไหม?";

/* Developer mode setting to always show onboarding suggestions. */
"Always show onboarding" = "แสดงขั้นตอนเริ่มต้นใช้งานทุกครั้ง";

/* Text indicating that they can contribute zaps to support Damus development. */
"An additional percentage of each zap will be sent to support Damus development" = "เปอร์เซ็นต์เพิ่มเติมจากทุกการ zap จะถูกส่งไปเพื่อสนับสนุนการพัฒนา Damus";

/* Error message for a failed contact list reset operation */
"An unexpected error happened while trying to create the new contact list. Please contact support." = "เกิดข้อผิดพลาดที่ไม่คาดคิดขณะพยายามสร้างรายชื่อติดต่อใหม่ กรุณาติดต่อฝ่ายสนับสนุน";

/* Label explaining there was an error, and suggesting next steps */
"An unexpected error occurred. Please contact Damus support via [Nostr](damus:npub18m76awca3y37hkvuneavuw6pjj4525fw90necxmadrvjg0sdy6qsngq955) or [email](support@damus.io) with the error message below." = "เกิดข้อผิดพลาดที่ไม่คาดคิด โปรดติดต่อฝ่ายสนับสนุนของ Damus ผ่าน [Nostr](damus:npub18m76awca3y37hkvuneavuw6pjj4525fw90necxmadrvjg0sdy6qsngq955) หรือ [email](support@damus.io) พร้อมข้อความแสดงข้อผิดพลาดด้านล่าง";

/* Toggle to enable or disable image animation */
"Animations" = "แอนิเมชัน";

/* Annual renewal of purple subscription */
"Annually" = "รายปี";

/* Button text to indicate that the zap type is a anonymous zap.
   Picker option to indicate that a zap should be sent anonymously and not identify the user as who sent it.
   Placeholder display name of anonymous user. */
"Anonymous" = "นิรนาม";

/* Any amount of sats */
"Any" = "อะไรก็ได้";

/* Prompt for optional entry of API Key to use translation server. */
"API Key (optional)" = "API Key (ทางเลือกเพิ่มเติม)";

/* Prompt for required entry of API Key to use translation server. */
"API Key (required)" = "API Key (จำเป็นต้องระบุ)";

/* Navigation title for text and appearance settings.
   Section header for text and appearance settings */
"Appearance" = "รูปลักษณ์";

/* Section header for text, appearance, and content filter settings */
"Appearance and filters" = "รูปลักษณ์และตัวกรอง";

/* Dropdown option for selecting Apple as a translation service. */
"apple_translation_service" = "แอปเปิ้ล";

/* Text asking the user if they are lost in the app. */
"Are you lost?" = "หลงทางอยู่รึป่าว ?";

/* Message explaining what it means to clear the cache, asking if user wants to proceed. */
"Are you sure you want to clear the cache? This will free space, but images may take longer to load again." = "คุณแน่ใจหรือไม่ ว่าต้องการล้างแคช? การทำเช่นนี้จะช่วยประหยัดพื้นที่ แต่อาจทำให้การโหลดรูปภาพใช้เวลานานขึ้น";

/* Prompt to ask user if they want to attach their Nostr Wallet Connect lightning wallet. */
"Are you sure you want to connect this wallet?" = "คุณแน่ใจหรือไม่ ว่าต้องการเชื่อมต่อกับกระเป๋าสตางค์นี้?";

/* Alert for deleting all of the bookmarks. */
"Are you sure you want to delete all of your bookmarks?" = "คุณแน่ใจหรือไม่ ว่าต้องการลบบุ๊กมาร์กทั้งหมด?";

/* Alert message asking if the user wants to upload media. */
"Are you sure you want to upload the selected media?" = "คุณแน่ใจหรือไม่ที่จะอัปโหลดสื่อที่เลือก ?";

/* Alert message asking if the user wants to upload an image. */
"Are you sure you want to upload this image?" = "คุณแน่ใจหรือไม่ ว่าต้องการอัปโหลดรูปภาพนี้?";

/* Alert message asking if the user wants to upload media. */
"Are you sure you want to upload this media?" = "คุณแน่ใจหรือไม่ ว่าต้องการอัปโหลดสื่อนี้?";

/* Message notifying the user that they get auto-translations as part of their service */
"As part of your Damus Purple membership, you get complimentary and automated translations. Would you like to enable Damus Purple translations?\n\nTip: You can always change this later in Settings → Translations" = "ในฐานะสมาชิก Damus Purple คุณจะได้รับบริการแปลภาษาอัตโนมัติโดยไม่เสียค่าใช้จ่าย คุณต้องการเปิดใช้งานการแปลภาษาของ Damus Purple หรือไม่?\n\nเคล็ดลับ: คุณสามารถเปลี่ยนการตั้งค่านี้ได้ทุกเมื่อในภายหลังที่ การตั้งค่า → การแปลภาษา";

/* Label to display that authentication to a server has succeeded. */
"Authenticated" = "ตรวจสอบสิทธิ์แล้ว";

/* Part 1 of 2 in message 'You unlocked automatic translations' the user gets when they sign up for Damus Purple */
"Automatic translations" = "การแปลอัตโนมัติ";

/* Toggle to automatically translate notes. */
"Automatically translate notes" = "แปลโน้ตอัตโนมัติ";

/* Description of new features to be expected */
"Be the first to access upcoming premium features: Automatic translations, longer note storage, and more" = "เป็นกลุ่มแรกที่เข้าถึงฟีเจอร์พรีเมียมใหม่ๆ ได้ก่อนใคร ไม่ว่าจะเป็นการแปลอัตโนมัติ พื้นที่เก็บโน้ตที่มากขึ้น และอื่นๆ อีกมากมาย";

/* Label to prompt bio entry for user to describe themself. */
"Bio" = "ประวัติ";

/* Label for Bitcoin Lightning Tips section of user profile form. */
"Bitcoin Lightning Tips" = "กระเป๋าบิตคอยน์ไลท์นิง";

/* Setting to blur images */
"Blur images" = "เบลอรูปภาพ";

/* Sidebar menu label for Bookmarks view.
   Title of bookmarks view */
"Bookmarks" = "บุ๊กมาร์ก";

/* Button to broadcast note to all your relays
   Context menu option for broadcasting the user's note to all of the user's connected relay servers. */
"Broadcast" = "บอร์ดคาสต์";

/* Toggle to enable or disable broadcasting what music is being played on Apple Music in their profile status. */
"Broadcast music playing on Apple Music" = "บอร์ดคาสต์เพลงที่กำลังเล่นบน Apple Music";

/* Disclaimer to user that they are agreeing to the End User License Agreement if they create an account or sign in. */
"By continuing, you agree to our EULA" = "ดำเนินการต่อ , แสดงว่าคุณยอมรับข้อตกลงการใช้งาน";

/* Text explaining the terms and conditions of subscribing to Damus Purple. EULA stands for End User License Agreement. */
"By subscribing to Damus Purple, you are accepting our [privacy policy](https://damus.io/privacy-policy.txt) and Apple's Standard [EULA](https://www.apple.com/legal/internet-services/itunes/dev/stdeula/)" = "การสมัครสมาชิก Damus Purple ถือว่าคุณยอมรับนโยบายความเป็นส่วนตัวของเราและข้อตกลงสิทธิ์การใช้งานมาตรฐาน (EULA) ของ Apple";

/* Message indicating that the cache was successfully cleared. */
"Cache has been cleared" = "ล้างแคชเรียบร้อยแล้ว";

/* Camera's permission denied error label */
"Camera's permission was denied. You can change this in iOS settings." = "ไม่ได้รับอนุญาตให้ใช้กล้อง คุณสามารถเปลี่ยนได้ในการตั้งค่า iOS";

/* Alert button to cancel out of alert for muting a user.
   Button to cancel a repost.
   Button to cancel any interaction with the QRCode link.
   Button to cancel out of alert that creates a new mutelist.
   Button to cancel out of posting a note.
   Button to cancel out of search text entry mode.
   Button to cancel the upload.
   Cancel button text for dismissing profile status settings view.
   Cancel button text for dismissing updating image url.
   Cancel deleting bookmarks.
   Cancel deleting the user.
   Cancel out of logging out the user.
   Cancel out of search view.
   Cancel resetting the contact list.
   Text for button to cancel out of connecting Nostr Wallet Connect lightning wallet. */
"Cancel" = "ยกเลิก";

/* Title indicating that the user has cancelled. */
"Cancelled" = "ยกเลิกแล้ว";

/* Message explaining consequences of changing the 'enable animation' setting */
"Changing this setting will cause the cache to be cleared. This will free space, but images may take longer to load again. Are you sure you want to proceed?" = "การเปลี่ยนการตั้งค่านี้จะเป็นการล้างแคช ซึ่งจะช่วยประหยัดพื้นที่ แต่อาจทำให้การโหลดรูปภาพใช้เวลานานขึ้น คุณแน่ใจหรือไม่ ว่าต้องการดำเนินการต่อ?";

/* Option to select photo from library */
"Choose from Library" = "เลือกจากคลังรูปภาพ";

/* Button for clearing bookmarks data. */
"Clear All" = "ล้างทั้งหมด";

/* Button to clear image cache. */
"Clear Cache" = "ล้างแคช";

/* Label to prompt user to select an expiration time for the profile status to clear. */
"Clear status" = "ล้างสถานะ";

/* Loading message indicating that the cache is being cleared. */
"Clearing Cache" = "กำลังล้างแคช";

/* Button label giving the user the option to close the sheet due to not being logged in.
   Button label giving the user the option to close the sheet from which they posted a highlight
   Button label giving the user the option to close the sheet from which they shared content
   Button label giving the user the option to close the sheet from which they were trying share.
   Button label giving the user the option to close the sheet from which they were trying to post a highlight
   Button label giving the user the option to close the sheet from which they were trying to share.
   Button label giving the user the option to close the view when no content is available to share */
"Close" = "ปิด";

/* Feature is still in development and will be available soon */
"Coming soon" = "เร็วๆ นี้";

/* Label announcing Purple, and inviting the user to learn more on the website */
"Coming soon! Visit our website to learn more" = "เร็วๆ นี้! เยี่ยมชมเว็บไซต์ของเราเพื่อเรียนรู้เพิ่มเติม";

/* Button to allow Damus Purple to be configured */
"Configure Damus Purple" = "กำหนดค่า Damus Purple";

/* Confirmation dialog title */
"Confirmation" = "การยืนยัน";

/* Button to connect to the relay.
   Text for button to conect to Nostr Wallet Connect lightning wallet. */
"Connect" = "เชื่อมต่อ";

/* Button to attach an Alby Wallet, a service that provides a Lightning wallet for zapping sats. Alby is the name of the service and should not be translated. */
"Connect to Alby Wallet" = "เชื่อมต่อกับ Alby Wallet";

/* Button to attach an Mutiny Wallet, a service that provides a Lightning wallet for zapping sats. Mutiny is the name of the service and should not be translated. */
"Connect to Mutiny Wallet" = "เชื่อมต่อกับ Mutiny Wallet";

/* Relay status label that indicates a relay is connecting. */
"Connecting" = "กำลังเชื่อมต่อ";

/* Text label indicating that the information below is the contact information of the admin of the Nostr relay. */
"CONTACT" = "รายชื่อ";

/* Section title for Contact list first aid tools */
"Contact list (Follows + Relay list)" = "รายชื่อติดต่อ (ผู้ติดตาม + รายการรีเลย์)";

/* Message indicating that the contact list was successfully reset. */
"Contact list has been reset" = "รีเซ็ตรายชื่อติดต่อแล้ว";

/* Section title for content filtering/moderation configuration. */
"Content filters" = "ตัวกรองเนื้อหา";

/* Button to dismiss suggested users view and continue to the main app
   Continue with bookmarks.
   Continue with deleting the user.
   Continue with resetting the contact list.
   Prompt to user to continue */
"Continue" = "ดำเนินการต่อ";

/* Label indicating that a user's key was copied. */
"Copied" = "คัดลอกแล้ว";

/* Button to copy a relay server address.
   Button to copy the value found.
   Context menu option for copying the version of damus. */
"Copy" = "คัดลอก";

/* Context menu option for copying the ID of the account that created the note. */
"Copy Account ID" = "คัดลอก Account ID";

/* Context menu option to copy an image into clipboard. */
"Copy Image" = "คัดลอกรูปภาพ";

/* Context menu option to copy the URL of an image into clipboard. */
"Copy Image URL" = "คัดลอก URL รูปภาพ";

/* Title of section for copying a Lightning invoice identifier. */
"Copy invoice" = "คัดลอก Invoice";

/* Button to copy link to note */
"Copy Link" = "คัดลอกลิงก์";

/* Context menu option for copying a user's Lightning URL. */
"Copy LNURL" = "คัดลอก LNURL";

/* Context menu option for copying the ID of the note. */
"Copy note ID" = "คัดลอกโน้ต ID";

/* Context menu option for copying the JSON text from the note. */
"Copy note JSON" = "คัดลอกโน้ตเป็น JSON";

/* Button to copy report ID. */
"Copy Report ID" = "คัดลอก Report ID";

/* Context menu option for copying the text from an note. */
"Copy text" = "คัดลอกข้อความ";

/* Copy URL of the selected uploaded media asset. */
"Copy URL" = "คัดลอก URL";

/* Context menu option for copying the ID of the user who created the note. */
"Copy user public key" = "คัดลอก npub";

/* Error message to the user indicating that the initial contact list failed to be created. */
"Could not create your initial contact list event. This is a software bug, please contact Damus support via support@damus.io or through our Nostr account for help." = "ไม่สามารถสร้างเหตุการณ์รายชื่อติดต่อเริ่มต้นของคุณได้ นี่เป็นข้อบกพร่องของซอฟต์แวร์ กรุณาติดต่อฝ่ายสนับสนุน Damus ทาง support@damus.io หรือผ่านบัญชี Nostr ของเราเพื่อขอความช่วยเหลือ";

/* Indicates that there are no users found. */
"Could not find the user you're looking for" = "ไม่พบผู้ใช้ที่คุณกำลังค้นหา";

/* Alert message to indicate that the muted user could not be found. */
"Could not find user to mute..." = "ไม่พบผู้ใช้ที่จะปิดการมองเห็น...";

/* Button to navigate to create account view. */
"Create account" = "สร้างบัญชี";

/* Button to continue to the create account page. */
"Create Account" = "สร้างบัญชี";

/* Title of alert prompting the user to create a new mutelist. */
"Create new mutelist" = "สร้าง mutelist ใหม่";

/* Dropdown option for selecting a custom translation server. */
"Custom" = "กำหนดค่า";

/* Name of the app for the title of an internal notification */
"Damus" = "Damus";

/* Accessibility label for damus logo */
"Damus logo" = "โลโก้ Damus";

/* Label for the preview of the profile picture */
"Damus Profile" = "โปรไฟล์ Damus";

/* Dropdown option for selecting Damus Purple as a translation service. */
"Damus Purple" = "Damus Purple";

/* Prompt selection of the Damus purple environment (Developer feature to switch between real/production mode to test modes). */
"Damus Purple environment" = "Damus Purple เวอร์ชัน";

/* Title text for Damus Wallet view. */
"Damus Wallet" = "Damus Wallet";

/* Dropdown option for selecting DeepL as the translation service. */
"DeepL (Proprietary, Higher Accuracy)" = "DeepL (ความแม่นยำสูง แต่เป็นระบบกรรมสิทธิ์)";

/* Button to pay a Lightning invoice with the user's default Lightning wallet. */
"Default Wallet" = "Wallet เริ่มต้น";

/* Title for section in zap settings that controls the default zap amount in sats. */
"Default Zap Amount in sats" = "จำนวน Zap เริ่มต้น ในหน่วย sats";

/* Button for deleting the users account.
   Button to remove a user from their mutelist. */
"Delete" = "ลบ";

/* Button to delete the user's account. */
"Delete Account" = "ลบบัญชี";

/* Description of the specific Nostr relay server. */
"Description" = "คำอธิบาย";

/* Navigation title for developer settings
   Section header for developer settings */
"Developer" = "นักพัฒนา";

/* Setting to enable developer mode */
"Developer Mode" = "โหมดนักพัฒนา";

/* Section header for Developer Settings view */
"Developer Mode enables features and options that may help developers diagnose issues and improve this app. Most users will not need Developer Mode." = "โหมดนักพัฒนาจะเปิดใช้งานฟีเจอร์และตัวเลือกที่อาจช่วยนักพัฒนาในการวินิจฉัยปัญหาและปรับปรุงแอปนี้ ผู้ใช้ส่วนใหญ่ไม่จำเป็นต้องใช้โหมดนักพัฒนา";

/* Alert user that changes have been made. */
"Discard changes?" = "ทิ้งการเปลี่ยนแปลง?";

/* Button to disconnect from a relay server.
   Button to disconnect from the relay. */
"Disconnect" = "ตัดการเชื่อมต่อ";

/* Text for button to disconnect from Nostr Wallet Connect lightning wallet. */
"Disconnect Wallet" = "ตัดการเชื่อมต่อ Wallet";

/* Button to dismiss alert */
"Dismiss" = "ยกเลิก";

/* Navigation title for DMs view, where DM is the English abbreviation for Direct Message.
   Navigation title for view of DMs, where DM is an English abbreviation for Direct Message.
   Picker option for DM selector for seeing only DMs that have been responded to. DM is the English abbreviation for Direct Message.
   Setting to enable DM Local Notification
   Toolbar label for DMs view, where DM is the English abbreviation for Direct Message. */
"DMs" = "DMs";

/* Button to dismiss wallet selection view for paying Lightning invoice.
   Button to leave edit mode for modifying the list of relays. */
"Done" = "เสร็จสิ้น";

/* Title of the duplicate relay error message. */
"Duplicate relay" = "รีเลย์ซ้ำ";

/* Label for profile status expiration duration picker.
   The duration in which to mute the given item. */
"Duration" = "ระยะเวลา";

/* Heading indicating that this application allows users to earn money. */
"Earn Money" = "สร้างรายได้";

/* Button to edit user's profile.
   Button to enter edit mode for modifying the list of relays.
   Edit Button for editing profile */
"Edit" = "แก้ไข";

/* Accessibility label for edit banner image button */
"Edit banner image" = "แก้ไขภาพแบนเนอร์";

/* Developer mode setting to enable experimental Purple API support. */
"Enable experimental Purple API support" = "เปิดใช้งานการรองรับ Purple API แบบทดลอง";

/* Developer mode setting to enable experimental Purple In-app purchase support. */
"Enable experimental Purple In-app purchase support" = "เปิดใช้งานการรองรับการซื้อในแอปของ Purple แบบทดลอง";

/* Label for button that allows users to enable Damus Purple translations */
"Enable Purple auto-translations" = "เปิดใช้งานการแปลอัตโนมัติของ Purple";

/* Heading indicating that this application keeps private messaging end-to-end encrypted. */
"Encrypted" = "เข้ารหัส";

/* Prompt for user to enter an account key to login. */
"Enter your account key" = "ป้อน account key ของคุณ";

/* Headline label for an error sheet on the QR code scanner
   Label to display that authentication to a server has failed.
   Relay status label that indicates a relay had an error when connecting
   Title indicating that an error has occurred. */
"Error" = "ข้อผิดพลาด";

/* Error label shown when user tries to enable push notifications but something fails */
"Error configuring push notifications with the server: %@" = "เกิดข้อผิดพลาดในการกำหนดค่าการแจ้งเตือนแบบ Push กับเซิร์ฟเวอร์:%@";

/* Error label shown when user tries to disable push notifications but something fails */
"Error disabling push notifications with the server: %@" = "เกิดข้อผิดพลาดในการปิดการแจ้งเตือนแบบ Push กับเซิร์ฟเวอร์:%@";

/* Message to display when there was an error fetching a lightning invoice while attempting to zap. */
"Error fetching lightning invoice" = "เกิดข้อผิดพลาดในการดึง lightning invoice";

/* Text for an item that application failed to retrieve the muted event for. */
"Error retrieving muted event" = "เกิดข้อผิดพลาดในการดึง muted event";

/* Error label shown when system tries to sync up notification preferences to the push notification server but something fails */
"Error syncing up push notifications preferences with the server: %@" = "ข้อผิดพลาดในการซิงค์การตั้งค่าการแจ้งเตือนแบบ Push กับเซิร์ฟเวอร์:%@";

/* Text on QR code camera view indicating an error */
"Error, please try again" = "เกิดข้อผิดพลาด กรุณาลองใหม่";

/* Error message indicating why saving keys failed. */
"Error: %@" = "ข้อผิดพลาด:%@";

/* Navigation title of view that shows the EULA, an acronym for End User License Agreement. */
"EULA" = "ข้อกำหนดการใช้งาน";

/* Description of public zap type where the zap is sent publicly and identifies the user who sent it. */
"Everyone will see that you zapped" = "ทุกคนจะเห็นว่าคุณ zap แล้ว";

/* Features only available on subscription service */
"Exclusive features" = "คุณสมบัติพิเศษ";

/* Indication that the execution of running a NostrScript finished successfully, while providing a numeric return code. */
"Executed successfully, returned with code %@" = "ดำเนินการเสร็จสิ้น ส่งค่ากลับด้วยโค้ด %@";

/* Badge indicating user has an expired Damus Purple account */
"Expired account" = "บัญชีหมดอายุ";

/* Label for Purple subscription expiry date */
"Expiry date" = "วันหมดอายุ";

/* Error label indicating about a failure in fetching notification preferences */
"Failed to get push notification preferences from the server" = "ล้มเหลวในการรับการตั้งค่าการแจ้งเตือนแบบ Push จากเซิร์ฟเวอร์";

/* NostrScript error message when it fails to initialize a module. */
"Failed to initialize" = "การเริ่มต้นล้มเหลว";

/* NostrScript error message when it fails to parse a script. */
"Failed to parse" = "การแยกวิเคราะห์ล้มเหลว";

/* Navigation title for first aid settings and tools
   Section header for first aid tools and settings */
"First Aid" = "ตรวจสอบบัญชี";

/* Button to follow a user. */
"Follow" = "ติดตาม";

/* Text on QR code view to prompt viewer looking at screen to follow the user. */
"Follow %@ on Nostr" = "ติดตาม %@ บน Nostr";

/* Button to follow all users in this section */
"Follow All" = "ติดตามทั้งหมด";

/* Button to follow a user back. */
"Follow Back" = "ติดตามกลับ";

/* Button to follow a given hashtag. */
"Follow hashtag" = "ติดตามแฮชแท็ก";

/* Text on QR code view to prompt viewer looking at screen to follow the user. */
"Follow me on Nostr" = "ถูกติดตามโดย";

/* Text to indicate that the user is followed by one of our follows. */
"Followed by %@" = "ถูกติดตามโดย %@";

/* Text to indicate that the user is followed by two of our follows. */
"Followed by %@ & %@" = "ถูกติดตามโดย %1$@ และ %2$@";

/* Text to indicate that the user is followed by three of our follows. */
"Followed by %@, %@ & %@" = "ถูกติดตามโดย %1$@ , %2$@ และ %3$@ ";

/* Label describing followers of a user.
   Navigation bar title for view that shows who is following a user. */
"Followers" = "ผู้ติดตาม";

/* Navigation bar title for view that shows who is following a user. */
"Followers You Know" = "ผู้ติดตามที่คุณรู้จัก";

/* Navigation bar title for view that shows who a user is following. */
"Following" = "กำลังติดตาม";

/* Label to indicate that the user is in the process of following another user. */
"Following..." = "กำลังติดตาม...";

/* Text to indicate that a user is following your profile. */
"Follows you" = "ติดตามคุณอยู่";

/* Section label for font size settings. */
"Font Size" = "ขนาดตัวอักษร";

/* First post example given to the user during onboarding, as a suggestion as to what they could post first */
"For #Introductions! I’m a software developer.\n\nMy side interests include languages and I am striving to be a #polyglot - I am a native English speaker and can speak French, German and Japanese." = "สำหรับ #Introduction! ฉันเป็นนักพัฒนาซอฟต์แวร์\n\nความสนใจรองของฉันคือเรื่องภาษา และฉันกำลังพยายามเป็น #polyglot - ฉันถนัดภาษาอังกฤษ และสามารถพูดภาษาฝรั่งเศส เยอรมัน และญี่ปุ่นได้";

/* Text on QR code camera view telling user that profile scan was successful. */
"Found profile!" = "พบโปรไฟล์แล้ว!";

/* Alert message asking if the user wants to open the link. */
"Found\n %@" = "พบ\n%@";

/* Dropdown option for selecting Free plan for DeepL translation service. */
"Free" = "ฟรี";

/* Human-readable short description of the 'friends filter' when it is set to 'friends-of-friends' */
"Friends of friends" = "เพื่อนของเพื่อน";

/* Section header for general damus notifications user configuration */
"General" = "ทั่วไป";

/* Supporter badge description */
"Get a special badge on your profile to show everyone your contribution to Freedom tech" = "รับป้ายพิเศษบนโปรไฟล์ของคุณเพื่อแสดงให้ทุกคนเห็นถึงการสนับสนุนเทคโนโลยีเพื่ออิสรภาพของคุณ";

/* Button to navigate to DeepL website to get a translation API key. */
"Get API Key" = "รับ API Key";

/* Button to navigate to nokyctranslate website to get a translation API key.
   Button to navigate to translate.nostr.wine to get a translation API key. */
"Get API Key with BTC/Lightning" = "รับ API Key ด้วย BTC/Lightning";

/* Button label giving the user the option to go to the app after posting a highlight
   Button label giving the user the option to go to the app after sharing content */
"Go to the app" = "ไปที่แอป";

/* Label for filter for seeing only hashtag follows.
   Section header title for a list of hashtags that are muted. */
"Hashtags" = "แฮชแท็ก";

/* First post example given to the user during onboarding, as a suggestion as to what they could post first */
"Hello everybody!\n\nThis is my first post on Damus, I am happy to meet you all 🤙. What’s up?\n\n#introductions" = "สวัสดีทุกคน!\n\nนี่เป็นโพสต์แรกของฉันบน Damus ฉันดีใจที่ได้พบกับทุกคน 🤙 เป็นยังไงกันบ้าง? \n\n#introductions";

/* Title for funding future damus development */
"Help Build The Future" = "ช่วยสร้างอนาคต";

/* Text indicating the goal of developing Damus which the user can help with. */
"Help build the future of decentralized communication on the web." = "ช่วยสร้างอนาคตของการสื่อสารแบบกระจายศูนย์บนเว็บ";

/* Damus purple subscription pitch */
"Help us stay independent in our mission for Freedom tech with our Purple subscription, and look cool doing it!" = "ช่วยเราให้ยังคงเป็นอิสระในพันธกิจด้านเทคโนโลยีเพื่ออิสรภาพด้วยการสมัครสมาชิก Purple ของเรา แล้วคุณจะดูเท่ไปพร้อมๆ กัน!";

/* Button to hide a note which has been muted. */
"Hide" = "ซ่อน";

/* Section footer describing OnlyZaps mode */
"Hide all 🤙's" = "ซ่อน 🤙 ทั้งหมด";

/* Setting to hide notes with the #nsfw (not safe for work) tags */
"Hide notes with #nsfw tags" = "ซ่อนโน้ตที่มีแท็ก #nsfw";

/* Label to indicate that the user is highlighting their own post. */
"Highlighted" = "ไฮไลต์";

/* Label to indicate that the user is highlighting 1 user. */
"Highlighted %@" = "ไฮไลต์ %@";

/* Navigation bar title for Home view where notes and replies appear from those who the user is following. */
"Home" = "หน้าแรก";

/* First post example given to the user during onboarding, as a suggestion as to what they could post first */
"Howdy! I’m a graphic designer during the day and coder at night, but I’m also trying to spend more time outdoors.\n\nHope to meet folks who are on their own journeys to a peaceful and free life!" = "สวัสดี! ฉันเป็นนักออกแบบกราฟิกในตอนกลางวัน และเป็นโปรแกรมเมอร์ตอนกลางคืน แต่ฉันก็พยายามใช้เวลากลางแจ้งมากขึ้นด้วย\n\nหวังว่าจะได้พบกับผู้คนที่กำลังเดินทางไปสู่ชีวิตที่สงบสุขและเป็นอิสระ!";

/* Placeholder example text for website URL for user profile. */
"https://jb55.com" = "https://jb55.com";

/* Description of report type for illegal content. */
"Illegal Content" = "เนื้อหาผิดกฎหมาย";

/* Prompt selection of user's image uploader */
"Image uploader" = "ตัวอัปโหลดรูปภาพ";

/* Option to enter a url */
"Image URL" = "URL ของรูปภาพ";

/* Section title for images configuration. */
"Images" = "รูปภาพ";

/* Description of report type for impersonation. */
"Impersonation" = "การแอบอ้าง";

/* Loading message indicating that a contact list reset operation is in progress. */
"In progress…" = "กำลังดำเนินการ...";

/* Mute a given item indefinitly (until user unmutes it). As opposed to muting the item for a given period of time. */
"Indefinite" = "ไม่มีกำหนด";

/* Badge indicating that a notification is an official internal app notification */
"Internal app notification" = "การแจ้งเตือนภายในแอป";

/* Error message indicating that an invalid account key was entered for login. */
"Invalid key" = "คีย์ไม่ถูกต้อง";

/* Message to display when there was an error attempting to zap due to an invalid lightning address. */
"Invalid lightning address" = "lightning address ไม่ถูกต้อง";

/* Error message when an invalid Nostr wallet connection string is provided. */
"Invalid Nostr wallet connection string" = "string ในการเชื่อมต่อ Nostr Wallet ไม่ถูกต้อง";

/* Title of alerting as invalid tip address. */
"Invalid Tip Address" = "Address สำหรับให้ทิปไม่ถูกต้อง";

/* Confirmation dialog question asking users if they want their translation settings to be automatically switched to the Damus Purple translation service */
"It seems that you already have a translation service configured. Would you like to switch to Damus Purple as your translator?" = "ดูเหมือนว่าคุณมีบริการแปลภาษาที่กำหนดค่าไว้แล้ว คุณต้องการเปลี่ยนไปใช้ Damus Purple เป็นตัวแปลภาษาของคุณหรือไม่?";

/* Placeholder example text for identifier used for Nostr addresses. */
"jb55@jb55.com" = "jb55@jb55.com";

/* Navigation title for managing keys.
   Settings section for managing keys */
"Keys" = "กุญแจ";

/* Label for a link to the Damus website, to allow the user to learn more about the features of Purple */
"Learn more about the features" = "เรียนรู้เพิ่มเติมเกี่ยวกับคุณสมบัติต่างๆ";

/* Moves the post button to the left side of the screen */
"Left Handed" = "ถนัดมือซ้าย";

/* Dropdown option for selecting LibreTranslate as the translation service. */
"LibreTranslate (Open Source)" = "LibreTranslate (โอเพนซอร์ส)";

/* Placeholder text for entry of Lightning Address or LNURL. */
"Lightning Address or LNURL" = "Lightning Address หรือ LNURL";

/* Indicates that the view is for paying a Lightning invoice. */
"Lightning Invoice" = "Lightning Invoice";

/* Accessibility Label for Like button */
"Like" = "ถูกใจ";

/* Setting to enable Like Local Notification */
"Likes" = "ถูกใจ";

/* Text indicator that the video is a livestream. */
"LIVE" = "ถ่ายทอดสด";

/* Button to show media in note. */
"Load media" = "โหลดสื่อ";

/* Option for notification mode setting: Local notification mode */
"Local" = "ภายใน";

/* Face ID usage description shown when trying to access private key */
"Local authentication to access private key" = "การพิสูจน์ตัวตนในเครื่องเพื่อเข้าถึง private key";

/* Dropdown option label for system default for Lightning wallet. */
"Local default" = "ค่าเริ่มต้นภายใน";

/* Section header for damus local notifications user configuration */
"Local Notifications" = "การแจ้งเตือนภายใน";

/* Button to log into account.
   Button to navigate to login view. */
"Login" = "เข้าสู่ระบบ";

/* Alert for logging out the user.
   Button for logging out the user.
   Sidebar menu label to sign out of the account. */
"Logout" = "ออกจากระบบ";

/* Label that appears when searching for note or profile */
"Looking for %@..." = "กำลังมองหา %@ ...";

/* Button label to indicate that tapping it will make the selected zap type be the default for future zaps. */
"Make Default" = "ตั้งเป็นค่าเริ่มต้น";

/* Hint message when an invalid Nostr wallet connection string is provided. */
"Make sure the wallet you are connecting to supports NWC." = "ตรวจสอบให้แน่ใจว่า Wallet ที่คุณกำลังเชื่อมต่อรองรับ NWC";

/* Reminder message in alert to get customer to verify that their private security account key is saved saved before logging out. */
"Make sure your nsec account key is saved before you logout or you will lose access to this account" = "ตรวจสอบให้แน่ใจว่าคีย์บัญชี nsec ของคุณถูกบันทึกไว้ก่อนที่คุณจะออกจากระบบ มิฉะนั้นคุณจะไม่สามารถเข้าถึงบัญชีนี้ได้";

/* Manage the damus subscription */
"Manage" = "จัดการ";

/* Button to take user to manage Damus Purple subscription */
"Manage subscription" = "จัดการการสมัครสมาชิก";

/* Setting to show media */
"Media previews" = "ตัวอย่างสื่อ";

/* Mentioned by heading in local notification */
"Mentioned by %@" = "ถูกกล่าวถึงโดย %@";

/* Label for filter for seeing mention notifications (replies, etc).
   Setting to enable Mention Local Notification */
"Mentions" = "กล่าวถึง";

/* Sidebar menu label for merch store link. */
"Merch" = "สินค้า";

/* Button label that allows the user to start a direct message conversation with the user shown on-screen */
"Message" = "ข้อความ";

/* Monthly renewal of purple subscription */
"Monthly" = "รายเดือน";

/* Alert button to mute a user.
   Button label that allows the user to mute the user shown on-screen
   Button to mute a profile
   Title for confirmation dialog to mute a profile. */
"Mute" = "ปิดการมองเห็น";

/* Alert message prompt to ask if a user should be muted. */
"Mute %@?" = "ปิดการมองเห็น %@ ?";

/* Context menu option for muting a conversation. */
"Mute conversation" = "ปิดการมองเห็นการสนทนา";

/* Label represnting a button that the user can tap to mute a given hashtag so they don't see it in their feed anymore. */
"Mute Hashtag" = "ปิดการมองเห็นแฮชแท็ก";

/* Title of alert for muting a user. */
"Mute User" = "ปิดการมองเห็นแฮชแท็ก";

/* Context menu option for muting users. */
"Mute user" = "ปิดการมองเห็นผู้นี้";

/* Navigation title of view to see list of muted users & phrases.
   Sidebar menu label for muted users view. */
"Muted" = "ปิดการมองเห็นแล้ว";

/* Title for a push notification which has been muted */
"Muted event" = "เหตุการณ์ที่ปิดการมองเห็น";

/* Title of the tab that shows the user's list of their own relays. */
"My Relays" = "รีเลย์ของฉัน";

/* Text label indicating that there is no NIP-11 relay admin contact information found. In English, N/A stands for not applicable.
   Text label indicating that there is no NIP-11 relay description information found. In English, N/A stands for not applicable.
   Text label indicating that there is no NIP-11 relay software information found. In English, N/A stands for not applicable.
   Text label indicating that there is no NIP-11 relay software version information found. In English, N/A stands for not applicable. */
"N/A" = "ไม่มีข้อมูล";

/* Label to prompt name entry. */
"Name" = "ชื่อ";

/* Profile status duration setting of never expiring. */
"Never" = "ไม่เคย";

/* Notification that the user has received a new direct message */
"New encrypted direct message" = "ข้อความส่วนตัวใหม่ที่เข้ารหัส";

/* Title label for push notifications where a direct message was sent to the user */
"New message" = "ข้อความใหม่";

/* Title label for push notifications where someone reacted to the user's post with a specific emoji */
"New note reaction" = "reaction ต่อโน้ตใหม่";

/* Ask the user if they are new to Nostr */
"New to Nostr?" = "ยังใหม่กับ Nostr ใช่ไหม ?";

/* Button to continue with account creation. */
"Next" = "ถัดไป";

/* Do not discard changes.
   User confirm No */
"No" = "ไม่";

/* Section footer for Contact list first aid tools */
"No contact list was found. You might experience issues using the app. If you suspect you have permanently lost your contact list (or if you never had one), you can fix this by resetting it" = "ไม่พบรายชื่อติดต่อ คุณอาจประสบปัญหาในการใช้แอป หากคุณสงสัยว่าสูญเสียรายชื่อติดต่ออย่างถาวร (หรือไม่เคยมี) คุณสามารถแก้ไขได้โดยรีเซ็ต";

/* Title indicating that there was no available content to share */
"No content available to share" = "ไม่มีเนื้อหาให้แชร์";

/* Label to indicate that there are no developer mode logs available to be displayed on the screen */
"No logs to display" = "ไม่มีบันทึกให้แสดง";

/* Alert message prompt that asks if the user wants to create a new mute list, overwriting previous mute lists. */
"No mute list found, create a new one? This will overwrite any previous mute lists." = "ไม่พบรายการปิดการมองเห็น , ต้องการสร้างรายการใหม่หรือไม่? การดำเนินการนี้จะเขียนทับรายการปิดการมองเห็นก่อนหน้า";

/* Description of anonymous zap type where the zap is sent anonymously and does not identify the user who sent it. */
"No one will see that you zapped" = "ไม่มีใครเห็นว่าคุณ Zap";

/* A label indicating that note search resulted in no results */
"No results" = "ไม่พบผลลัพธ์";

/* Title indicating that a highlight cannot be posted because no text was selected. */
"No text selected" = "ไม่มีข้อความที่เลือก";

/* Description of non-zap type where sats are sent to the user's wallet as a regular Lightning payment, not as a zap. */
"No zaps will be sent, only a lightning payment." = "จะไม่มีการส่ง zap ใดๆ มีเพียงการชำระเงินด้วย lightning เท่านั้น";

/* Label for button that allows users to reject enabling Damus Purple translations */
"No, thanks" = "ไม่ ขอบคุณ";

/* Dropdown option for selecting NoKYCTranslate.com as the translation service. */
"NoKYCTranslate.com (Prepay with BTC)" = "NoKYCTranslate.com (ชำระล่วงหน้าด้วย BTC)";

/* Button text to indicate that the zap type is a private zap.
   Picker option to indicate that sats should be sent to the user's wallet as a regular Lightning payment, not as a zap. */
"None" = "ไม่มี";

/* No search results. */
"none" = "ไม่มี";

/* Dropdown option for selecting no translation service. */
"none_translation_service" = "ไม่มี";

/* Label for the Nostr Address section of user profile form. */
"Nostr Address" = "Nostr Address";

/* Navigation title for the view showing NostrScript. */
"NostrScript" = "NostrScript";

/* Text indicating that there was an error with loading NostrScript. There is a more descriptive error message shown separately underneath. */
"NostrScript Error" = "NostrScript ผิด";

/* Title indicating that a highlight cannot be posted because the user is not logged in. */
"Not logged in" = "ไม่ได้เข้าสู่ระบบ";

/* Title indicating that sharing cannot proceed because the user is not logged in. */
"Not Logged In" = "ไม่ได้เข้าสู่ระบบ";

/* Button to not save key, complete account creation, and start using the app. */
"Not now" = "ไม่ใช่ตอนนี้";

/* Text to indicate that what is being shown is a note which has been muted. */
"Note from a %@ you've muted" = "โน้ตจาก %@ ที่คุณปิดการมองเห็นเอาไว้";

/* Label indicating note has been muted
   Text to indicate that what is being shown is a note which has been muted. */
"Note you've muted" = "โน้ตที่คุณปิดการมองเห็นเอาไว้";

/* A label indicating that the notes being displayed below it are from a timeline, not search results
   Label for filter for seeing only notes (instead of notes and replies). */
"Notes" = "โน้ต";

/* Label for filter for seeing notes and replies (instead of only notes). */
"Notes & Replies" = "โน้ตและการตอบกลับ";

/* Section footer clarifying what #nsfw (not safe for work) tags mean */
"Notes with the #nsfw tag usually contains adult content or other \"Not safe for work\" content" = "โน้ตที่มีแท็ก #nsfw มักจะมีเนื้อหาสำหรับผู้ใหญ่หรือเนื้อหาอื่น ๆ ที่ \"ไม่เหมาะสมสำหรับที่ทำงาน\"";

/* Indicates that there are no notes in the timeline to view. */
"Nothing to see here. Check back later!" = "ไม่มีอะไรให้ดูที่นี่ แล้วกลับมาดูใหม่นะจ้ะ !";

/* Section header for notification indicator dot settings */
"Notification Dots" = "จุดแจ้งเตือน";

/* Section header for Notification Preferences */
"Notification Preferences" = "การตั้งค่าการแจ้งเตือน";

/* Section header for Damus notifications
   Toolbar label for Notifications view. */
"Notifications" = "การแจ้งเตือน";

/* Prompt selection of the notification mode (Feature to switch between local notifications (generated from user's own phone) or push notifications (generated by Damus server). */
"Notifications mode" = "โหมดการแจ้งเตือน";

/* Relative time label that indicates a notification happened now
   String indicating that a given timestamp just occurred */
"now" = "ตอนนี้";

/* Placeholder example for relay server address. */
"npub, #hashtag, phrase" = "npub, #hashtag, phrase";

/* Prompt for user to enter in an account key to login. This text shows the characters the key could start with if it was a private key. */
"nsec1…" = "nsec1...";

/* Description of report type for nudity. */
"Nudity" = "ภาพโป๊เปลือย";

/* Button label indicating user wants to proceed.
   Button label to dismiss an error dialog */
"OK" = "โอเค";

/* Button to dismiss the alert. */
"Ok" = "โอเค";

/* Relay status label that indicates a relay is connected. */
"Online" = "ออนไลน์";

/* Help text on green lock icon that explains that only the current user can see the message of a zap event and who sent the zap. */
"Only you can see this message and who sent it." = "ไม่มีใครนอกจากคุณที่สามารถเห็นข้อความนี้และเห็นว่าใครเป็นผู้ส่ง";

/* Section header for enabling OnlyZaps mode (hide reactions) */
"OnlyZaps" = "OnlyZaps";

/* Non-tappable text in context menu that shows up when the zap button on profile is long pressed to indicate that the user has enabled OnlyZaps, meaning that they would like to be only zapped and not accept reactions to their notes. */
"OnlyZaps Enabled" = "เปิดใช้งาน OnlyZaps แล้ว";

/* Setting toggle to hide reactions. */
"OnlyZaps mode" = "โหมด OnlyZaps";

/* Button to open the value found in browser. */
"Open in browser" = "เปิดในเบราว์เซอร์";

/* Button to open the value found in browser. */
"Open in wallet" = "เปิดใน Wallet";

/* Label indicating that a form input is optional. */
"optional" = "ไม่บังคับ";

/* Prompt to enter optional additional information when reporting an account or content. */
"Optional" = "ไม่บังคับ";

/* Button label that allows the user to start a direct message conversation with the user shown on-screen, to orange-pill them (i.e. help them to setup zaps) */
"Orange-pill" = "ยาส้ม";

/* Text indicating that this is a paid relay. */
"Paid Relay" = "รีเลย์แบบชำระเงิน";

/* Text for button to connect a lightning wallet. */
"Paste NWC Address" = "วาง NWC Address";

/* Accessibility label for the private key paste button */
"Paste private key" = "วางไพรเวทคีย์";

/* Button to pay a Lightning invoice. */
"Pay" = "ชำระเงิน";

/* Navigation bar title for view to pay Lightning invoice. */
"Pay the Lightning invoice" = "จ่าย Lightning Invoice";

/* Label to display that authentication to a server is pending. */
"Pending" = "รอดำเนินการ";

/* Label for filter for seeing only people follows. */
"People" = "ผู้คน";

/* Alert for deleting the users account.
   Section title for deleting the user */
"Permanently Delete Account" = "ลบบัญชีถาวร";

/* Prompt selection of DeepL subscription plan to perform machine translations on notes */
"Plan" = "แผน";

/* Instructions on how to filter a specific timeline feed by choosing relay servers to filter on. */
"Please choose relays from the list below to filter the current feed:" = "โปรดเลือกรีเลย์จากรายการด้านล่างเพื่อกรองฟีดปัจจุบัน:";

/* Text on QR code camera view instructing user to point to QR code */
"Point your camera to a QR code…" = "เล็งกล้องไปที่ QR Code";

/* Button to post a note. */
"Post" = "โพสต์";

/* Title indicating that the user has posted a highlight successfully */
"Posted" = "โพสต์แล้ว";

/* Title indicating that the highlight post is being published to the network */
"Posting" = "กำลังโพสต์";

/* Button text to indicate that the zap type is a private zap.
   Heading indicating that this application keeps personally identifiable information private. A sentence describing what is done to keep data private comes after this heading.
   Picker option to indicate that a zap should be sent privately and not identify the user to the public. */
"Private" = "ส่วนตัว";

/* Title of the secure field that holds the user's private key. */
"Private Key" = "คีย์ส่วนตัว";

/* Title of notification when a private zap is received. */
"Private Zap" = "Zap แบบส่วนตัว";

/* Description of private zap type where the zap is sent privately and does not identify the user to the public. */
"private_zap_description" = "มีเพียง '%@' เท่านั้นที่จะเห็นว่าคุณ Zap พวกเขา";

/* Dropdown option for selecting Pro plan for DeepL translation service. */
"Pro" = "โปร";

/* Label indicating the production environment for Damus Purple
   Label indicating the production environment for Push notification functionality */
"Production" = "Production";

/* Description of report type for profanity. */
"Profanity" = "คำหยาบคาย";

/* Sidebar menu label for Profile view. */
"Profile" = "โปรไฟล์";

/* Section footer clarifying what the profile action sheet feature does */
"Profile action sheets allow you to follow, zap, or DM profiles more quickly without having to view their full profile" = "โปรไฟล์แอคชั่นชีท ช่วยให้คุณติดตาม zap หรือส่ง DM ให้โปรไฟล์ได้เร็วขึ้น โดยไม่ต้องดูโปรไฟล์ทั้งหมด";

/* Section title for profile view configuration. */
"Profiles" = "โปรไฟล์";

/* Button text to indicate that the zap type is a public zap.
   Picker option to indicate that a zap should be sent publicly and identify the user as who sent it. */
"Public" = "สาธารณะ";

/* Section title for the user's public account ID. */
"Public Account ID" = "กุญแจสาธารณะ";

/* Label indicating that the text is a user's public account key. */
"Public key" = "กุญแจสาธารณะ";

/* Indicating when the user purchased the subscription */
"Purchased on" = "ซื้อเมื่อ";

/* User purchased a subscription */
"Purchased!" = "ซื้อแล้ว!";

/* Loading label indicating the purchase action is in progress */
"Purchasing" = "กำลังซื้อ";

/* Subscription service name */
"Purple" = "Purple";

/* Option for notification mode setting: Push notification mode */
"Push" = "Push";

/* Prompt selection of the Push notification environment (Developer feature to switch between real/production mode to test modes). */
"Push notification environment" = "ระบบการแจ้งเตือนแบบ Push";

/* Button to view profile's qr code. */
"QR Code" = "QR โค้ด";

/* Button to compose a quoted note */
"Quote" = "อ้างอิง";

/* Navigation bar title for Quote Reposts view. */
"Quotes" = "คำพูด";

/* Indication that a NostrScript was run until it reached a suspended state. */
"Ran to suspension." = "ทำงานจนถูกระงับ";

/* Accessibility label for react button */
"React with default reaction emoji" = "React ด้วยอีโมจิเริ่มต้น";

/* Navigation bar title for Reactions view.
   Section header for reactions settings
   Title of emoji reactions view */
"Reactions" = "Reactions";

/* Title of the tab that shows the list of relays recommended by Damus. */
"Recommended" = "แนะนำ";

/* Text label indicating that the text below it are developer mode logs. */
"Relay Logs" = "บันทึกรีเลย์";

/* Navigation bar title that shows the list of relays for a user.
   Sidebar menu label for Relays view.
   Title of relays view */
"Relays" = "รีเลย์";

/* Description of what was done as a result of sending a report to relay servers. */
"Relays have been notified and clients will be able to use this information to filter content. Thank you!" = "รีเลย์ได้รับแจ้งแล้วและไคลเอ็นต์จะสามารถใช้ข้อมูลนี้เพื่อกรองเนื้อหาได้ ขอบคุณ!";

/* Button label to remove all participants from a note reply. */
"Remove all" = "ลบทั้งหมด";

/* Context menu option for removing a note bookmark. */
"Remove bookmark" = "ลบบุ๊กมาร์ก";

/* Button text to remove bookmark from a note. */
"Remove Bookmark" = "ลบบุ๊กมาร์ก";

/* Button to take user to renew subscription for one month */
"Renew (1 mo)" = "ต่ออายุ (1 เดือน)";

/* Button to take user to renew subscription for one year */
"Renew (1 yr)" = "ต่ออายุ (1 ปี)";

/* Indicating when the subscription will renew */
"Renews on" = "ต่ออายุเมื่อ";

/* Accessibility label for reply button */
"Reply" = "ตอบกลับ";

/* Text indicating that the view is used for editing which participants are replied to in a note. */
"Replying to" = "ตอบกลับ";

/* Indicating that the user is replying to the following listed people.
   Indicating that the user is replying to the themself and no one else, where the parameter is 'self' in US English.
   Label to indicate that the user is replying to 1 user. */
"Replying to %@" = "ตอบกลับ %@";

/* Label to indicate that the user is replying to 2 users. */
"Replying to %@ & %@" = "ตอบกลับ %1$@ และ %2$@";

/* Label to indicate that the user is replying to themself. */
"Replying to self" = "ตอบกลับตัวเอง";

/* Button to report a profile.
   Context menu option for reporting content.
   Label indicating that the current view is for the user to report content. */
"Report" = "รายงาน";

/* Label indicating that the text underneath is the identifier of the report that was sent to relay servers. */
"Report ID:" = "รายงาน ID:";

/* Button to report a note. */
"Report Note" = "รายงานโน้ต";

/* Message indicating that a report was successfully sent to relay servers. */
"Report sent!" = "ส่งรายงานแล้ว!";

/* Button to report a user. */
"Report User" = "รายงานผู้ใช้";

/* Button to repost a note */
"Repost" = "รีโพสต์";

/* Accessibility label for repost/quote button */
"Repost or quote this note" = "รีโพสต์หรืออ้างอิงโน้ตนี้";

/* Text indicating that the note was reposted (i.e. re-shared). */
"Reposted" = "รีโพสต์";

/* Reposted by heading in local notification */
"Reposted by %@" = "รีโพสต์โดย %@";

/* Accessibility label for boosts button
   Navigation bar title for Reposts view.
   Setting to enable Repost Local Notification */
"Reposts" = "การรีโพสต์";

/* Picker option for DM selector for seeing only message requests (DMs that someone else sent the user which has not been responded to yet */
"Requests" = "คำขอ";

/* Label indicating that a form input is required. */
"required" = "จำเป็น";

/* Button to reset contact list. */
"Reset contact list" = "รีเซ็ตรายชื่อติดต่อ";

/* Button to retry completing account creation after an error occurred. */
"Retry" = "ลองใหม่";

/* Button that runs a NostrScript. */
"Run" = "เรียกใช้";

/* Indication that the execution of a NostrScript is running. */
"Running..." = "กำลังทำงาน...";

/* Indication that a runtime error occurred when running a NostrScript. */
"Runtime error" = "ข้อผิดพลาดขณะรันไทม์";

/* Name of Bitcoin creator(s). */
"Satoshi Nakamoto" = "ซาโตชิ นากาโมโตะ";

/* Button for saving profile.
   Button to save key, complete account creation, and start using the app. */
"Save" = "บันทึก";

/* Percentage of purchase price the user will save */
"Save 14%" = "ประหยัด 14%";

/* Savings for purchasing an annual subscription */
"Save 20% off on an annual subscription" = "ประหยัด 20% เมื่อสมัครสมาชิกรายปี";

/* Context menu option to save an image. */
"Save Image" = "บันทึกรูปภาพ";

/* Toggle to save private key to the Apple secure keychain. */
"Save Key in Secure Keychain" = "บันทึกคีย์ในพวงกุญแจรักษาความปลอดภัย";

/* Ask user if they want to save their account information. */
"Save your login info?" = "บันทึกข้อมูลเข้าสู่ระบบของคุณ?";

/* Text to prompt scanning a QR code of a user's pubkey to open their profile. */
"Scan a user's pubkey" = "สแกน คีย์สาธารณะ ของผู้ใช้";

/* Button to switch to scan QR Code page. */
"Scan Code" = "สแกนโค้ด";

/* Context menu option to scan image for a QR Code. */
"Scan for QR Code" = "สแกนหา QR โค้ด";

/* Text for button to connect a lightning wallet. */
"Scan NWC Address" = "สแกน NWC Address";

/* Accessibility label for a button that scans a private key QR code */
"Scan QR code" = "สแกน QR Code";

/* Text on QR code view to prompt viewer to scan the QR code on screen with their device camera. */
"Scan the code" = "สแกนโค้ด";

/* Text to prompt scanning a QR code of a user's privkey to login to their profile. */
"Scan Your Private Key QR" = "สแกน QR โค้ด ของคีย์ส่วนตัวของคุณ";

/* Default title for the search screen when it is in an unknown state.
   Title of the text field for searching. */
"Search" = "ค้นหา";

/* Navigation link to search for a word. */
"Search word: %@" = "ค้นหาคำ: %@";

/* Placeholder text to prompt entry of search query. */
"Search..." = "ค้นหา...";

/* Navigation title for universe/search settings.
   Section header for search/universe settings */
"Search/Universe" = "ค้นหา/ยูนิเวิร์ส";

/* Section title for user's secret account login key. */
"Secret Account Login Key" = "กุญแจลับส่วนบุคคล";

/* Text to prompt user to connect their wallet using 'Nostr Wallet Connect'. */
"Securely connect your Damus app to your wallet using Nostr Wallet Connect" = "เชื่อมต่อแอป Damus กับวอลเล็ตของคุณอย่างปลอดภัยด้วย Nostr Wallet Connect";

/* Title of section for selecting a Lightning wallet to pay a Lightning invoice. */
"Select a Lightning wallet" = "เลือก Lightning Wallet";

/* Prompt selection of user's default emoji reaction */
"Select default emoji" = "เลือกอีโมจิเริ่มต้น";

/* Prompt selection of user's default wallet */
"Select default wallet" = "เลือก Wallet เริ่มต้น";

/* Part of a larger sentence 'Replying to self' in US English. 'self' indicates that the user is replying to themself and no one else. */
"self" = "ตัวเอง";

/* Text prompt for user to send a message to the other user. */
"Send a message to start the conversation..." = "ส่งข้อความเพื่อเริ่มการสนทนา...";

/* Placeholder text for a comment to send as part of a zap to the user. */
"Send a message with your zap..." = "ส่งข้อความพร้อมกับ Zap ของคุณ...";

/* Prompt selection of LibreTranslate server to perform machine translations on notes */
"Server" = "เซิร์ฟเวอร์";

/* Prompt selection of translation service provider. */
"Service" = "บริการ";

/* Navigation title for Settings view.
   Sidebar menu label for accessing the app settings */
"Settings" = "การตั้งค่า";

/* Button to share a note
   Button to share an image.
   Button to share the link to a profile.
   Save button text for saving profile status settings. */
"Share" = "แชร์";

/* Accessibility label for external share button */
"Share externally" = "แชร์ออกไปข้างนอก";

/* Title text to indicate that the buttons below are meant to be used to share a note with others. */
"Share Note" = "แชร์โน้ต";

/* Button to present iOS share sheet */
"Share Via..." = "แชร์ผ่าน...";

/* Title indicating that the user has shared content successfully */
"Shared" = "แชร์แล้ว";

/* Label for the preview of the image being picture */
"Shared Picture" = "รูปภาพที่แชร์";

/* Title indicating that the content is being published to the network */
"Sharing" = "กำลังแชร์";

/* Button to show a note which has been muted.
   Toggle to show or hide user's secret account login key. */
"Show" = "แสดง";

/* Settings toggle for enabling general user statuses */
"Show general statuses" = "แสดงสถานะทั่วไป";

/* Button to show less of a long profile description. */
"Show less" = "แสดงน้อยลง";

/* Button to show entire note.
   Button to show more of a long profile description. */
"Show more" = "แสดงเพิ่มเติม";

/* Settings toggle for enabling now playing music statuses */
"Show music statuses" = "แสดงสถานะเพลง";

/* Setting to Show notifications only associated to users your follow */
"Show only from users you follow" = "แสดงเฉพาะจากผู้ใช้ที่คุณติดตาม";

/* Toggle to show notes that are only in the device's preferred languages on the Universe feed and hide notes that are in other languages. */
"Show only preferred languages on Universe feed" = "แสดงเฉพาะภาษาที่ต้องการในฟีดยูนิเวิร์ส";

/* Setting to show profile action sheets when clicking on a user's profile picture */
"Show profile action sheets" = "แสดงโปรไฟล์แอคชั่นชีท";

/* Toggle to show or hide selection of wallet. */
"Show wallet selector" = "แสดงตัวเลือก Wallet";

/* Accessibility label for the side menu button at the topbar */
"Side menu" = "แถบเมนู";

/* Title of view to log into an account. */
"Sign in" = "เข้าสู่ระบบ";

/* Button to continue to login page. */
"Sign In" = "เข้าสู่ระบบ";

/* Section title for signing out */
"Sign Out" = "ออกจากระบบ";

/* Sidebar menu label to sign out of the account. */
"Sign out" = "ออกจากระบบ";

/* Button to dismiss the suggested users screen */
"Skip" = "ข้าม";

/* Text label indicating which relay software is used to run this Nostr relay. */
"SOFTWARE" = "ซอฟต์แวร์";

/* Title label for push notification where someone posted a note */
"Someone posted a note" = "มีคนโพสต์โน้ต";

/* Generic title label for push notifications where someone reacted to the user's post */
"Someone reacted to your note" = "มีคน React ต่อโน้ตของคุณ";

/* Body label for push notifications where someone reacted to the user's post with a specific emoji */
"Someone reacted to your note with %@" = "มีคน React ต่อโน้ตของคุณด้วย %@";

/* Title label for a push notification where someone zapped the user */
"Someone zapped you ⚡️" = "⚡️ มีคน zap คุณ ⚡️";

/* Text on QR code camera view telling the user a QR is incompatible */
"Sorry, this QR code looks incompatible with Damus. Please try another one." = "ขออภัย QR Code นี้ดูเหมือนจะไม่รองรับกับ Damus กรุณาลองแบบอื่น";

/* Description of report type for spam.
   Section header for Universe/Search spam */
"Spam" = "สแปม";

/* Label indicating a staging test environment for Damus Purple functionality (Developer feature) */
"Staging" = "Staging";

/* Label indicating the staging environment for Push notification functionality */
"Staging (for dev builds)" = "Staging (for dev builds)";

/* Placeholder as an example of what the user could set as their profile status. */
"Staying humble..." = "สวัสดีจ้า...";

/* Label for Purple account subscriber number */
"Subscriber number" = "หมายเลขผู้สมัคร";

/* Ah dang there was an error loading subscription information from the AppStore. Please try again later :( */
"Subscription Error" = "ข้อผิดพลาดการสมัครสมาชิก";

/* Label indicating success in syncing notification preferences */
"Successfully synced" = "ซิงค์สำเร็จแล้ว";

/* A label indicating that the items below it are suggested hashtags */
"Suggested hashtags" = "แฮชแท็กแนะนำ";

/* Text calling for the user to support Damus through zaps */
"Support Damus" = "สนับสนุน Damus";

/* Reason for supporting damus development */
"Support Damus development to help build the future of decentralized communication on the web." = "สนับสนุนการพัฒนา Damus เพื่อช่วยสร้างอนาคตของการสื่อสารแบบกระจายศูนย์บนเว็บ";

/* Label to display relay's supported NIPs. */
"Supported NIPs" = "รองรับ NIPs";

/* Title for supporter badge */
"Supporter Badge" = "ป้ายผู้สนับสนุน";

/* Label indicating success in syncing notification preferences */
"Syncing" = "กำลังซิงค์";

/* Tagged by heading in local notification */
"Tagged by %@" = "ติดแท็กโดย %@";

/* Option to take a photo with the camera */
"Take Photo" = "ถ่ายรูป";

/* Label indicating a local test environment for Damus Purple functionality (Developer feature)
   Label indicating a local test environment for Push notification functionality (Developer feature) */
"Test (local)" = "Test (local)";

/* Section header for damus text truncation user configuration */
"Text Truncation" = "การตัดข้อความ";

/* Appreciation to user for purchasing subscription service */
"Thank you very much for signing up for Damus Purple. Your contribution helps us continue our fight for a more Open and Free internet.\n\nYou will also get access to premium features, and a star badge on your profile.\n\nEnjoy!" = "ขอบคุณมากที่สมัครใช้งาน Damus Purple การสนับสนุนของคุณช่วยให้เราสามารถต่อสู้เพื่ออินเทอร์เน็ตที่เปิดกว้างและเสรี คุณจะได้รับสิทธิ์การใช้งานพิเศษและ สัญลักษณ์รูปดาว บนโปรไฟล์ของคุณ สนุกกับการใช้งานนะ!";

/* Button to close out of alert that informs that the action to muted a user was successful. */
"Thanks!" = "ขอบคุณ!";

/* Giving the description of the alert message. */
"The address should either begin with LNURL or should look like an email address." = "ที่อยู่ควรขึ้นต้นด้วย LNURL หรือควรมีลักษณะคล้ายกับที่อยู่อีเมล";

/* Camera's bad input error label */
"The camera could not be accessed." = "ไม่สามารถเข้าถึงกล้องได้";

/* Camera's bad output error label */
"The camera was not capable of scanning the requested codes." = "กล้องไม่สามารถสแกนรหัสที่ต้องการได้";

/* An error message that appears when the user attempts to add a relay that has already been added. */
"The relay you are trying to add is already added.\nYou're all set!" = "รีเลย์ที่คุณกำลังจะเพิ่มมีอยู่แล้ว\n\nคุณพร้อมแล้ว!";

/* Quick description of what Damus is */
"The social network you control" = "เครือข่ายสังคมที่คุณเป็นผู้ควบคุม";

/* In-app purchase error message for the user */
"There has been an unexpected error with the in-app purchase. Please try again later or contact support@damus.io. Error: %@" = "เกิดข้อผิดพลาดที่ไม่คาดคิดกับการซื้อภายในแอป โปรดลองอีกครั้งในภายหลังหรือติดต่อ support@damus.io ข้อผิดพลาด:%@";

/* Label explaining that no content is available to share and instructing the user to close the view and try again. */
"There is no content available to share at this time. Please close this view and try again." = "ไม่มีเนื้อหาให้แชร์ในขณะนี้ กรุณาปิดหน้านี้แล้วลองใหม่";

/* Error label when Purple account information fails to load */
"There was an error loading your account. Please try again later. If problem persists, please contact us at support@damus.io" = "เกิดข้อผิดพลาดในการโหลดบัญชีของคุณ โปรดลองอีกครั้งในภายหลัง หากยังมีปัญหา กรุณาติดต่อเราที่ support@damus.io";

/* Camera's initialization error label */
"There was an unexpected error in initializing the camera." = "เกิดข้อผิดพลาดที่ไม่คาดคิดในการเริ่มต้นกล้อง";

/* Notice label that user cannot manage their In-App purchases */
"This device's in-app purchase is registered to a different Nostr account. Unable to manage this Purple account. If you believe this was a mistake, please contact us via support@damus.io." = "การซื้อภายในแอปของอุปกรณ์นี้ลงทะเบียนกับบัญชี Nostr อื่น ไม่สามารถจัดการบัญชี Purple นี้ได้ หากคุณคิดว่านี่เป็นข้อผิดพลาด กรุณาติดต่อเราที่ support@damus.io";

/* Warning that the inputted account key is a public key and the result of what happens because of it. */
"This is a public key, you will not be able to make notes or interact in any way. This is used for viewing accounts from their perspective." = "นี่คือกุญแจสาธารณะ คุณจะไม่สามารถจดบันทึกหรือโต้ตอบได้ สิ่งนี้ใช้สำหรับดูบัญชีจากมุมมองของพวกเขา";

/* Description for a push notification which has been muted, and explanation that we cannot suppress it */
"This is an event that has been muted according to your mute list rules. We cannot suppress this notification, but we obscured the details to respect your preferences" = "นี่คือเหตุการณ์ที่ถูกปิดค่าการมองเห็นตามกฎรายการปิดการมองเห็นของคุณ เราไม่สามารถระงับการแจ้งเตือนนี้ได้ แต่เราได้ซ่อนรายละเอียดเพื่อเคารพการตั้งค่าของคุณ";

/* First post example given to the user during onboarding, as a suggestion as to what they could post first */
"This is my first post on Nostr 💜. I love drawing and folding Origami!\n\nNice to meet you all! #introductions #plebchain " = "นี่คือโพสต์แรกของฉันบน Nostr 💜 ฉันชอบวาดรูปและพับโอริงามิ!\n\nยินดีที่ได้รู้จักทุกคน! #introductions #plebchain";

/* Error message indicating that a note is too big and cannot be rendered */
"This note contains too many items and cannot be rendered" = "โน้ตนี้มีรายการมากเกินไปและไม่สามารถแสดงผลได้";

/* Comment explaining why a user cannot be zapped. */
"This user cannot be zapped because they have not configured zaps on their account yet. Time to orange-pill?" = "ผู้ใช้นี้ไม่สามารถรับ Zap ได้เนื่องจากยังไม่ได้กำหนดค่าแซปในบัญชีของพวกเขา ถึงเวลาแล้วที่ต้องป้ายยาส้ม ?";

/* Navigation bar title for note thread. */
"Thread" = "เธรด";

/* Section header title for a list of threads that are muted. */
"Threads" = "เธรด";

/* Instruction on how to verify npub during Damus Purple checkout */
"To continue your Purple subscription checkout, please verify your npub by clicking on the button below" = "หากต้องการดำเนินการต่อการสมัครใช้งาน Purple กรุณายืนยัน npub ของคุณโดยคลิกที่ปุ่มด้านล่าง";

/* Accessibility label for toggling the visibility of the private key input field */
"Toggle key visibility" = "สลับการแสดงกุญแจ";

/* A label indicating that the notes being displayed below it are all top note search results */
"Top hits" = "ฮิตสูงสุด";

/* Text indicating that this zap is the one with the highest amount of sats. */
"Top Zap" = "Zap สูงสุด";

/* Toggle to translate direct messages. */
"Translate DMs" = "แปล DMs";

/* Button to translate note from different language. */
"Translate Note" = "แปลโน้ต";

/* Dropdown option for selecting translate.nostr.wine as the translation service. */
"translate.nostr.wine (DeepL, Pay with BTC)" = "translate.nostr.wine (DeepL, ชำระด้วย BTC)";

/* Button to indicate that the note has been translated from a different language. */
"Translated from %@" = "แปลจาก %@";

/* Navigation title for translation settings.
   Section header for text and appearance settings */
"Translation" = "การแปล";

/* Section title for selecting the translation service. */
"Translations" = "การแปล";

/* Setting to truncate text in mention notifications */
"Truncate notification mention text" = "ตัดข้อความแจ้งเตือนที่กล่าวถึง";

/* Setting to truncate text in timeline */
"Truncate timeline text" = "ตัดข้อความไทม์ไลน์";

/* Text field prompt asking user to type DELETE in all caps to confirm that they want to proceed with deleting their account. */
"Type %@ to delete" = "พิมพ์ %@ เพื่อลบ";

/* Text box prompt to ask user to type their note. */
"Type your note here..." = "พิมพ์โน้ตของคุณที่นี่...";

/* Alert message letting user know a QR Code was not found. */
"Unable to find a QR Code" = "ไม่พบคิวอาร์โค้ด";

/* Button to unfollow a user. */
"Unfollow" = "เลิกติดตาม";

/* Button to unfollow a given hashtag. */
"Unfollow hashtag" = "เลิกติดตามแฮชแท็ก";

/* Label to indicate that the user is in the process of unfollowing another user. */
"Unfollowing..." = "กำลังเลิกติดตาม...";

/* Toolbar label for the universal view where notes from all connected relay servers appear. */
"Universe 🛸" = "ยูนิเวิร์ส 🛸";

/* Button to unmute a profile. */
"Unmute" = "เลิกปิดการมองเห็น";

/* Context menu option for unmuting a conversation. */
"Unmute conversation" = "เลิกปิดเการมองเห็นการสนทนา";

/* Label represnting a button that the user can tap to unmute a given hashtag so they start seeing it in their feed again. */
"Unmute Hashtag" = "เลิกปิดการมองเห็นแฮชแท็ก";

/* Title of longform event if it is untitled. */
"Untitled" = "ไม่มีชื่อ";

/* Update button text for updating image url. */
"Update" = "อัปเดต";

/* Button to proceed with uploading. */
"Upload" = "อัปโหลด";

/* Custom URL host for Damus Purple testing
   Custom URL host for Damus push notification testing
   Example URL to LibreTranslate server */
"URL" = "URL";

/* Alert message that informs a user was muted. */
"User has been muted" = "ปิดการมองเห็นผู้ใช้แล้ว";

/* Alert message to indicate the user has been muted */
"User muted" = "ปิดการมองเห็นผู้ใช้";

/* Headline indicating a user cannot be zapped */
"User not zappable" = "ผู้ใช้ไม่สามารถรับ Zap ได้";

/* Section header for user profile status settings. */
"User Statuses" = "สถานะผู้ใช้";

/* Label for Username section of user profile form. */
"Username" = "ชื่อผู้ใช้";

/* Section header title for a list of muted users. */
"Users" = "ผู้ใช้";

/* Instructions after the user has verified their npub for Damus Purple purchase checkout */
"Verified!" = "ยืนยันแล้ว";

/* Button label to verify the user's npub for the purpose of Purple subscription checkout */
"Verify my npub" = "ยืนยัน npub ของฉัน";

/* Section title for displaying the version number of the Damus app. */
"Version" = "เวอร์ชัน";

/* Text label indicating which version of the relay software is being run for this Nostr relay. */
"VERSION" = "เวอร์ชัน";

/* A button label that allows the user to see the full profile of the profile they are previewing */
"View full profile" = "ดูโปรไฟล์เต็ม";

/* Setting to only see 1 event per user (npub) in the search/universe */
"View multiple events per user" = "ดูหลายเหตุการณ์ต่อผู้ใช้";

/* Button to switch to view users QR Code */
"View QR Code" = "ดูคิวอาร์โค้ด";

/* Instruction on how to manage billing externally */
"Visit the Damus website on a web browser to manage billing" = "เยี่ยมชมเว็บไซต์ Damus บนเว็บเบราว์เซอร์เพื่อจัดการการเรียกเก็บเงิน";

/* Text telling the user to wake up, where the argument is their display name. */
"Wake up, %@" = "ตื่นๆ %@";

/* Navigation title for attaching Nostr Wallet Connect lightning wallet.
   Navigation title for Wallet view
   Sidebar menu label for Wallet view.
   Title for section in zap settings that controls the Lightning wallet selection. */
"Wallet" = "Wallet";

/* Label text indicating that below it is the wallet address. */
"Wallet Address" = "Wallet Address";

/* Label text indicating that below it is the information about the wallet relay. */
"Wallet Relay" = "รีเลย์ Wallet";

/* Alert for resetting the user's contact list. */
"WARNING:\n\nThis will reset your contact list, including the list of everyone you follow and the list of all relays you usually connect to. ONLY PROCEED IF YOU ARE SURE YOU HAVE LOST YOUR CONTACT LIST BEYOND RECOVERABILITY." = "คำเตือน:\n\nการดำเนินการนี้จะรีเซ็ตรายชื่อติดต่อของคุณ รวมถึงรายชื่อทุกคนที่คุณติดตามและรายการรีเลย์ทั้งหมดที่คุณเชื่อมต่อเป็นประจำ ดำเนินการต่อเฉพาะเมื่อคุณแน่ใจว่าคุณสูญเสียรายชื่อติดต่อโดยไม่สามารถกู้คืนได้เท่านั้น";

/* Alert for deleting the users account. */
"WARNING:\n\nTHIS WILL SIGN AN EVENT THAT DELETES THIS ACCOUNT.\n\nYOU WILL NO LONGER BE ABLE TO LOG INTO DAMUS USING THIS ACCOUNT KEY.\n\n ARE YOU SURE YOU WANT TO CONTINUE?" = "คำเตือน:\n\nการกระทำนี้จะลงนามในเหตุการณ์ที่ลบบัญชีนี้\n\nคุณจะไม่สามารถเข้าสู่ระบบ DAMUS โดยใช้คีย์บัญชีนี้ได้อีกต่อไป\n\nคุณแน่ใจหรือไม่ว่าต้องการดำเนินการต่อ?";

/* Message indicating that no First Aid actions are available. */
"We did not detect any issues that we can automatically fix for you. If you are having issues, please contact Damus support: [support@damus.io](mailto:support@damus.io)" = "เราไม่พบปัญหาใดที่เราสามารถแก้ไขให้คุณโดยอัตโนมัติ หากคุณประสบปัญหา กรุณาติดต่อฝ่ายสนับสนุน Damus: [support@damus.io](mailto:support@damus.io)";

/* Reminder to user that they should save their account information. */
"We'll save your account key, so you won't need to enter it manually next time you log in." = "เราจะบันทึกคีย์บัญชีของคุณ เพื่อให้คุณไม่ต้องป้อนด้วยตนเองในการเข้าสู่ระบบครั้งถัดไป​​​​​​​​​​​​​​​​";

/* Label for Website section of user profile form. */
"Website" = "เว็บไซต์";

/* Welcome text shown on the first screen when user is not logged in. */
"Welcome to Damus" = "ยินดีต้อนรับสู่ Damus";

/* Greeting to subscription service */
"Welcome to Purple" = "ยินดีต้อนรับสู่ Purple";

/* Welcoming message to the reader. The variable is 'you', the reader. */
"Welcome to the social network %@ control." = "ยินดีต้อนรับสู่เครือข่ายสังคม %@ ที่คุณควบคุมได้เอง";

/* Welcome text */
"Welcome to the social network you control" = "ยินดีต้อนรับสู่เครือข่ายสังคมที่คุณควบคุมได้เอง";

/* Text to welcome user. */
"Welcome!" = "ยินดีต้อนรับ!";

/* Text to welcome user. */
"Welcome, %@!" = "ยินดีต้อนรับ %@!";

/* Header text to prompt user what issue they want to report. */
"What do you want to report?" = "คุณต้องการรายงานอะไร?";

/* Title for a screen displaying suggestions of who to follow */
"Who to Follow" = "ใครที่ควรติดตาม";

/* Section header title for a list of words that are muted. */
"Words" = "คำ";

/* Placeholder example for relay server address. */
"wss://some.relay.com" = "wss://some.relay.com";

/* Agree to discard changes made to profile.
   User confirm Yes */
"Yes" = "ใช่";

/* Text of button that confirms to overwrite the existing mutelist. */
"Yes, Overwrite" = "ใช่ เขียนทับ";

/* You, in this context, is the person who controls their own social network. You is used in the context of a larger sentence that welcomes the reader to the social network that they control themself. */
"you" = "คุณ";

/* Text telling the user that they are dreaming. */
"You are dreaming..." = "คุณกำลังฝัน...";

/* Label explaining a highlight cannot be made because the user is not logged in */
"You cannot post a highlight because you are not logged in with a private key! Please close this, login with a private key (or nsec), and try again." = "คุณไม่สามารถโพสต์ไฮไลต์ได้เนื่องจากคุณไม่ได้ล็อกอินด้วยคีย์ส่วนตัว! กรุณาปิดหน้านี้ ล็อกอินด้วยคีย์ส่วนตัว (หรือ nsec) แล้วลองอีกครั้ง";

/* Label explaining a highlight cannot be made because there was no selected text, and some instructions on how to resolve the issue */
"You cannot post a highlight because you have selected no text on the page! Please close this, select some text, and try again." = "คุณไม่สามารถโพสต์ไฮไลต์ได้เนื่องจากคุณไม่ได้เลือกข้อความใดๆ บนหน้า! กรุณาปิดหน้านี้ เลือกข้อความบางส่วน แล้วลองอีกครั้ง";

/* Label explaining that sharing cannot proceed because the user is not logged in. */
"You cannot share content because you are not logged in. Please close this view, log in to your account, and try again." = "คุณไม่สามารถแชร์เนื้อหาได้เนื่องจากไม่ได้เข้าสู่ระบบ กรุณาปิดหน้านี้ เข้าสู่ระบบบัญชีของคุณ แล้วลองใหม่";

/* Text indicating that there are no bookmarks to be viewed */
"You have no bookmarks yet, add them in the context menu" = "คุณยังไม่มีบุ๊กมาร์ก เพิ่มบุ๊กมาร์กในบริบทเมนู";

/* Part 1 of 2 in message 'You unlocked automatic translations' the user gets when they sign up for Damus Purple */
"You unlocked" = "คุณปลดล็อคแล้ว";

/* Label explaining that their content sharing action is in progress */
"Your content is being broadcasted to the network. Please wait." = "กำลังเผยแพร่เนื้อหาของคุณไปยังเครือข่าย กรุณารอสักครู่​​​​​​​​​​​​​​​​";

/* Label explaining there their highlight publishing action is in progress */
"Your highlight is being broadcasted to the network. Please wait." = "กำลังเผยแพร่ไฮไลต์ของคุณไปยังเครือข่าย กรุณารอสักครู่";

/* Label for Your Name section of user profile form. */
"Your Name" = "ชื่อของคุณ";

/* A notification message explaining to the user that their Damus Purple Subscription is expiring soon, prompting them to renew. */
"Your Purple subscription expires in %@ days. Renew?" = "การสมัครใช้งาน Purple ของคุณจะหมดอายุในอีก %@ วัน ต่ออายุหรือไม่?";

/* A notification message explaining to the user that their Damus Purple Subscription is expiring in one day, prompting them to renew. */
"Your Purple subscription expires in 1 day. Renew?" = "การสมัครใช้งาน Purple ของคุณจะหมดอายุในอีก 1 วัน ต่ออายุหรือไม่?";

/* A notification message explaining to the user that their Damus Purple Subscription has expired, prompting them to renew. */
"Your Purple subscription has expired. Renew?" = "การสมัครใช้งาน Purple ของคุณหมดอายุแล้ว ต่ออายุหรือไม่?";

/* Footer text to inform user what will happen when the report is submitted. */
"Your report will be sent to the relays you are connected to" = "รายงานของคุณจะถูกส่งไปยังรีเลย์ที่คุณเชื่อมต่ออยู่";

/* Accessibility label for zap button
   Button label that allows the user to zap (i.e. send a Bitcoin tip via the lightning network) the user shown on-screen
   Text underneath the number of sats indicating that it's the amount used for zaps.
   Title of notification when a non-private zap is received. */
"Zap" = "Zap";

/* Message to display when sending a zap from the user's connected wallet failed. */
"Zap attempt from connected wallet failed." = "ความพยายามในการ Zap จาก Wallet ที่เชื่อมต่อล้มเหลว";

/* Message to display when a zap from the user's connected wallet was canceled. */
"Zap attempt from connected wallet was canceled." = "ความพยายามในการ Zap จาก Wallet ที่เชื่อมต่อถูกยกเลิก";

/* Button label indicating that a zap action was unsuccessful (i.e. the user was unable to send a Bitcoin tip via the lightning network to the user shown on-screen) 
   Title of an alert indicating that a zap action failed */
"Zap failed" = "Zap ล้มเหลว";

/* Text to indicate that the buttons below it is for choosing the type of zap to send. */
"Zap type" = "ประเภท Zap";

/* Button to send a zap. */
"Zap User" = "Zap ผู้ใช้";

/* Setting to enable vibration on zap */
"Zap Vibration" = "การสั่นเมื่อ Zap";

/* Button label indicating that a zap action was successful (i.e. the user is successfully sent a Bitcoin tip via the lightning network to the user shown on-screen)  */
"Zapped!" = "Zap แล้ว!";

/* Button label indicating that a zap action is in progress (i.e. the user is currently sending a Bitcoin tip via the lightning network to the user shown on-screen)  */
"Zapping" = "กำลัง Zap";

/* Text to indicate that the app is in the process of sending a zap. */
"Zapping..." = "กำลัง...Zap";

/* Label for filter for zap notifications.
   Navigation bar title for the Zaps view.
   Navigation title for zap settings.
   Section header for zap settings
   Setting to enable Zap Local Notification
   Title for section in zap settings that controls general zap preferences. */
"Zaps" = "Zaps";

